In [1]:
import pandas as pd

nba = pd.read_csv("nba.csv")
nba["Salary"]+1000

0      7731337.0
1      6797117.0
2            NaN
3      1149640.0
4      5001000.0
         ...
453    2434333.0
454     901000.0
455    2901000.0
456     948276.0
457          NaN
Name: Salary, Length: 458, dtype: float64

In [2]:
# -------Sorting Values in particular columns----------
nba.sort_values(["Team","Name"])

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
312,Al Horford,Atlanta Hawks,15.0,C,30.0,6-10,245.0,Florida,12000000.0
318,Dennis Schroder,Atlanta Hawks,17.0,PG,22.0,6-1,172.0,NaN,1763400.0
323,Jeff Teague,Atlanta Hawks,0.0,PG,27.0,6-2,186.0,Wake Forest,8000000.0
309,Kent Bazemore,Atlanta Hawks,24.0,SF,26.0,6-5,201.0,Old Dominion,2000000.0
311,Kirk Hinrich,Atlanta Hawks,12.0,SG,35.0,6-4,190.0,Kansas,2854940.0
...,...,...,...,...,...,...,...,...,...
376,Markieff Morris,Washington Wizards,5.0,PF,26.0,6-10,245.0,Kansas,8000000.0
375,Nene Hilario,Washington Wizards,42.0,C,33.0,6-11,250.0,NaN,13000000.0
378,Otto Porter Jr.,Washington Wizards,22.0,SF,23.0,6-8,198.0,Georgetown,4662960.0
379,Ramon Sessions,Washington Wizards,7.0,PG,30.0,6-3,190.0,Nevada,2170465.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
df = pd.read_csv("employees.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null object
Start Date           1000 non-null object
Last Login Time      1000 non-null object
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    933 non-null object
Team                 957 non-null object
dtypes: float64(1), int64(1), object(6)
memory usage: 39.1+ KB

In [4]:
# -----------Convert unclean massive data to clean data ----------------

# ---Convert string to DateTime ----
pd.to_datetime(df["Start Date"])
df["Start Date"] = pd.to_datetime(df["Start Date"])
df["Last Login Time"]

df["Last Login Time"] = pd.to_datetime(df["Last Login Time"])

df["Last Login Time"]

0     2020-03-18 12:42:00
1     2020-03-18 06:53:00
2     2020-03-18 11:17:00
3     2020-03-18 13:00:00
4     2020-03-18 16:47:00
              ...
995   2020-03-18 06:09:00
996   2020-03-18 06:30:00
997   2020-03-18 12:39:00
998   2020-03-18 16:45:00
999   2020-03-18 18:24:00
Name: Last Login Time, Length: 1000, dtype: datetime64[ns]

In [5]:
# ---- Convert String to Boolean -----
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Senior Management"]

# ------convert some informaion by Cetagory-----
df["Gender"] = df["Gender"].astype("category")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null category
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null datetime64[ns]
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    1000 non-null bool
Team                 957 non-null object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 41.1+ KB

In [6]:
# -----------------------Filtering Data with Condision -------------------

mask = df[df["Team"] == "Finance"]
mask = mask[mask["Gender"] == "Male"]
mask = mask[mask["Salary"] < 80000 ]
mask = mask[mask["Senior Management"] == True]
mask

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
286,Todd,Male,1984-02-02,2020-03-18 10:13:00,69989,10.985,True,Finance
304,Jeremy,Male,1981-08-12,2020-03-18 00:05:00,46930,18.702,True,Finance
328,Samuel,Male,1991-12-19,2020-03-18 02:54:00,76076,5.319,True,Finance
341,Carlos,Male,2007-09-19,2020-03-18 01:01:00,77327,11.580,True,Finance
428,Christopher,Male,1999-05-13,2020-03-18 10:48:00,68028,7.869,True,Finance
710,Edward,Male,1997-11-27,2020-03-18 01:00:00,58327,17.095,True,Finance
773,NaN,Male,1986-10-24,2020-03-18 09:23:00,47176,10.736,True,Finance
831,Kenneth,Male,2015-01-15,2020-03-18 14:41:00,69112,7.588,True,Finance

In [7]:
df["Bonus %"] < 1.5
df["Bonus %"] > 1.5

df["Start Date"] <= "1985-01-01"
mask["Start Date"] >= "2000-01-01"

mask[mask["Start Date"] >= "2000-01-01"]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
341,Carlos,Male,2007-09-19,2020-03-18 01:01:00,77327,11.580,True,Finance
831,Kenneth,Male,2015-01-15,2020-03-18 14:41:00,69112,7.588,True,Finance

In [8]:
# ------Filter Dataframe with AND & OR Operators| 2018 |Python 3---------

In [9]:
# -------------AND Operator -------------------
mask1 = df["Gender"] == "Male"
mask2 = df["Team"] == "Marketing"
df[mask1 & mask2]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-03-18 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2020-03-18 02:12:00,100612,13.645,False,Marketing
26,Craig,Male,2000-02-27,2020-03-18 07:45:00,37598,7.757,True,Marketing
74,Thomas,Male,1995-06-04,2020-03-18 14:24:00,62096,17.029,False,Marketing
77,Charles,Male,2004-09-14,2020-03-18 20:13:00,107391,1.260,True,Marketing
101,Aaron,Male,2012-02-17,2020-03-18 10:20:00,61602,11.849,True,Marketing
104,John,Male,1989-12-23,2020-03-18 07:01:00,80740,19.305,False,Marketing
112,Willie,Male,2003-11-27,2020-03-18 06:21:00,64363,4.023,False,Marketing
119,Paul,Male,2008-06-03,2020-03-18 15:05:00,41054,12.299,False,Marketing
150,Sean,Male,1996-05-04,2020-03-18 20:59:00,135490,19.934,False,Marketing
187,Roger,Male,2004-11-19,2020-03-18 15:55:00,51430,6.460,False,Marketing
204,Willie,Male,2006-06-06,2020-03-18 09:45:00,55281,4.935,True,Marketing
216,Matthew,Male,2013-07-31,2020-03-18 08:04:00,142373,2.462,False,Marketing
252,Ralph,Male,2004-11-11,2020-03-18 01:35:00,71896,4.232,True,Marketing
274,Howard,Male,1982-10-05,2020-03-18 07:22:00,97490,5.460,True,Marketing
293,Jesse,Male,1999-10-25,2020-03-18 15:35:00,118733,9.653,False,Marketing
309,Benjamin,Male,1984-09-11,2020-03-18 06:37:00,84810,15.794,False,Marketing
327,Aaron,Male,1994-01-29,2020-03-18 18:48:00,58755,5.097,True,Marketing
353,NaN,Male,1997-04-22,2020-03-18 21:36:00,65078,3.095,True,Marketing
403,Craig,Male,1984-02-08,2020-03-18 04:45:00,113506,19.642,False,Marketing
413,Johnny,Male,1992-09-14,2020-03-18 08:21:00,115194,5.861,True,Marketing
452,Scott,Male,2012-11-17,2020-03-18 14:47:00,146812,1.965,True,Marketing
454,NaN,Male,1995-02-21,2020-03-18 00:26:00,136602,10.429,True,Marketing
461,Jeremy,Male,2001-08-09,2020-03-18 03:56:00,43354,13.946,False,Marketing
464,Lawrence,Male,2005-05-13,2020-03-18 01:25:00,74640,18.641,False,Marketing
484,Joe,Male,2000-04-14,2020-03-18 15:14:00,50645,11.119,False,Marketing
496,Johnny,Male,2016-02-26,2020-03-18 19:39:00,76394,5.437,True,Marketing
503,Roger,Male,2015-08-03,2020-03-18 16:56:00,125033,4.887,True,Marketing
544,Roger,Male,2010-07-03,2020-03-18 17:11:00,105689,13.320,True,Marketing
550,Gregory,Male,1984-06-18,2020-03-18 03:46:00,82726,16.304,True,Marketing
556,Arthur,Male,2014-12-16,2020-03-18 16:56:00,66819,6.639,True,Marketing
571,Jonathan,Male,1995-04-06,2020-03-18 22:38:00,56993,18.623,False,Marketing
581,Ernest,Male,1990-01-28,2020-03-18 00:08:00,81919,15.118,False,Marketing
696,Samuel,Male,2012-05-25,2020-03-18 16:40:00,85550,11.593,True,Marketing
722,Joshua,Male,1997-06-27,2020-03-18 15:23:00,95003,5.197,True,Marketing
798,Lawrence,Male,1984-10-01,2020-03-18 14:06:00,102589,17.952,True,Marketing
860,Phillip,Male,1984-10-07,2020-03-18 11:05:00,36837,14.660,False,Marketing
867,Earl,Male,2013-06-15,2020-03-18 03:00:00,48046,7.737,False,Marketing
899,Walter,Male,1992-05-21,2020-03-18 00:39:00,144701,16.323,True,Marketing
947,NaN,Male,2012-07-30,2020-03-18 15:07:00,107351,5.329,True,Marketing
994,George,Male,2013-06-21,2020-03-18 17:47:00,98874,4.479,True,Marketing

In [10]:
# ---------------OR Operator------------------

mask3 = df["Senior Management"]
mask4 = df["Start Date"] < "1990-01-01"
df[mask3 | mask4]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-03-18 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-03-18 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2020-03-18 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-03-18 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2020-03-18 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
992,Anthony,Male,2011-10-16,2020-03-18 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2020-03-18 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2020-03-18 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2020-03-18 06:30:00,42392,19.675,False,Finance
999,Albert,Male,2012-05-15,2020-03-18 18:24:00,129949,10.169,True,Sales

In [11]:
mask5 = df["First Name"] == "Robert" 
mask6 = df["Team"] == "Client Services"
mask7 = df["Start Date"] > "2016-06-01"
df[(mask5 & mask6) | mask7]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
15,Lillian,Female,2016-06-05,2020-03-18 06:09:00,59414,1.256,False,Product
98,Tina,Female,2016-06-16,2020-03-18 19:47:00,100705,16.961,True,Marketing
387,Robert,Male,1994-10-29,2020-03-18 04:26:00,123294,19.894,False,Client Services
451,Terry,NaN,2016-07-15,2020-03-18 00:29:00,140002,19.490,True,Marketing

In [12]:
# ---------------------.isin() Method in Pandas-----------------------
# This is for providing multiple argument

In [13]:
ma = df["Team"].isin(["Legal","Sales","Product"])
ma1 = df["Senior Management"].isin([True,False])

df[(ma & ma1)]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
5,Dennis,Male,1987-04-18,2020-03-18 01:35:00,115163,10.125,False,Legal
6,Ruby,Female,1987-08-17,2020-03-18 16:20:00,65476,10.012,True,Product
11,Julie,Female,1997-10-26,2020-03-18 15:19:00,102508,12.637,True,Legal
13,Gary,Male,2008-01-27,2020-03-18 23:40:00,109831,5.831,False,Sales
15,Lillian,Female,2016-06-05,2020-03-18 06:09:00,59414,1.256,False,Product
...,...,...,...,...,...,...,...,...
981,James,Male,1993-01-15,2020-03-18 17:19:00,148985,19.280,False,Legal
985,Stephen,NaN,1983-07-10,2020-03-18 20:10:00,85668,1.909,False,Legal
989,Justin,NaN,1991-02-10,2020-03-18 16:58:00,38344,3.794,False,Legal
997,Russell,Male,2013-05-20,2020-03-18 12:39:00,96914,1.421,False,Product
999,Albert,Male,2012-05-15,2020-03-18 18:24:00,129949,10.169,True,Sales

In [14]:
# -------------isnull() & .notnull()--------------
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-03-18 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-03-18 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-03-18 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-03-18 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-03-18 16:47:00,101004,1.389,True,Client Services

In [15]:
nu = df["Team"].isnull() #This is give all null vakue
notnu = df["Gender"].notnull() # this is give not null value 
df[notnu]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-03-18 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-03-18 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-03-18 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-03-18 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-03-18 16:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2020-03-18 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2020-03-18 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2020-03-18 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2020-03-18 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2020-03-18 18:24:00,129949,10.169,True,Sales

In [16]:
# -------.between() Method in Pandas| 2018 |Python 3--------

In [17]:
df.head(4)
df[df["Salary"].between(60000,70000)]
df[df["Bonus %"].between(2.0,5.0)]

# -----some filtering with data ------
teams = df["Team"].isin(["Legal"])
males = df["Gender"].isin(["Male"])
logintimes = df["Last Login Time"].between("10:00AM","11:00AM")
df[(males & logintimes) & teams]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
81,Christopher,Male,2008-03-30,2020-03-18 10:52:00,47369,14.822,False,Legal

In [27]:
# ------- .duplicated() Method --------------

df.sort_values(["First Name","Team"], inplace=True)

df["First Name"].duplicated()

df[df["First Name"].duplicated()].head()

df["First Name"].duplicated(keep = 'last')
df[df["First Name"].duplicated(keep = 'last')].head()

df["First Name"].duplicated(keep = False)
df[df["First Name"].duplicated(keep = False)].head()

# --------- (~) Shift+ESC button for reverse oparation --------- 
maskk = ~df["First Name"].duplicated(keep = False)
df[maskk]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
8,Angela,Female,2005-11-22,2020-03-18 06:29:00,95570,18.523,True,Engineering
688,Brian,Male,2007-04-07,2020-03-18 22:47:00,93901,17.821,True,Legal
190,Carol,Female,1996-03-19,2020-03-18 03:39:00,57783,9.129,False,Finance
887,David,Male,2009-12-05,2020-03-18 08:48:00,92242,15.407,False,Legal
5,Dennis,Male,1987-04-18,2020-03-18 01:35:00,115163,10.125,False,Legal
495,Eugene,Male,1984-05-24,2020-03-18 10:54:00,81077,2.117,False,Sales
33,Jean,Female,1993-12-18,2020-03-18 09:07:00,119082,16.180,False,Business Development
832,Keith,Male,2003-02-12,2020-03-18 15:02:00,120672,19.467,False,Legal
291,Tammy,Female,1984-11-11,2020-03-18 10:30:00,132839,17.463,True,Client Services

In [32]:
# --------------- Drop Duplicate ------------

len(df.drop_duplicates(subset=["First Name"],keep="first"))
df.drop_duplicates(subset=["First Name"],keep="first")

df.drop_duplicates(subset=["First Name","Team"],keep="last") #Here we use or condistions

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
937,Aaron,NaN,1986-01-22,2020-03-18 19:39:00,63126,18.424,False,Client Services
327,Aaron,Male,1994-01-29,2020-03-18 18:48:00,58755,5.097,True,Marketing
137,Adam,Male,2011-05-21,2020-03-18 01:45:00,95327,15.120,False,Distribution
538,Adam,Male,2010-10-08,2020-03-18 21:53:00,45181,3.491,False,Human Resources
141,Adam,Male,1990-12-24,2020-03-18 20:57:00,110194,14.727,True,Product
...,...,...,...,...,...,...,...,...
165,NaN,Female,2014-03-23,2020-03-18 13:28:00,59148,9.061,True,Legal
947,NaN,Male,2012-07-30,2020-03-18 15:07:00,107351,5.329,True,Marketing
812,NaN,Male,1994-12-13,2020-03-18 10:34:00,141311,5.478,True,Product
925,NaN,Female,2000-08-23,2020-03-18 16:19:00,95866,19.388,True,Sales
951,NaN,Female,2010-09-14,2020-03-18 05:19:00,143638,9.662,True,NaN

In [36]:
df.drop_duplicates(subset=["First Name","Team"], keep=False)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
137,Adam,Male,2011-05-21,2020-03-18 01:45:00,95327,15.120,False,Distribution
141,Adam,Male,1990-12-24,2020-03-18 20:57:00,110194,14.727,True,Product
300,Alan,Male,1988-06-26,2020-03-18 03:54:00,111786,3.592,True,Engineering
53,Alan,NaN,2014-03-03,2020-03-18 13:28:00,40341,17.578,True,Finance
610,Alan,Male,2012-02-17,2020-03-18 00:26:00,41453,10.084,False,Product
...,...,...,...,...,...,...,...,...
177,Wayne,Male,2012-04-07,2020-03-18 08:00:00,102652,14.085,True,Distribution
943,Wayne,Male,2006-09-08,2020-03-18 11:09:00,67471,2.728,False,Engineering
637,Wayne,Male,2009-09-02,2020-03-18 01:37:00,126956,18.396,False,Human Resources
941,William,Male,1997-06-26,2020-03-18 08:33:00,104840,15.653,True,Engineering
450,Willie,Male,2009-08-22,2020-03-18 13:03:00,55038,19.691,False,Legal